{
    "categories": [
        {
            "id": 0,
            "name": "Ділові події",
            "mainImage": "/images/categories/1_1.webp",
            "images": [
                "/images/categories/1_1.webp",
                "/images/categories/1_2.webp",
                "/images/categories/1_3.webp",
                "/images/categories/1_4.webp",
                "/images/categories/1_5.webp",
                "/images/categories/1_6.webp"
            ],
            "text": [
                "Конференції та форуми – це надзвичайно мультизадачний процес, який потребує системного підходу до всіх елементів івенту: ретельного підбору локації, врахування логістики, організації харчування учасників, оптимізації проходження реєстрації та забезпечення технічної підтримки. ",
                "Global Events має багаторічний досвід в організації масштабних ділових подій, а також Global Events є організатором власного вузькоспеціалізованого форуму Event Industry Forum. Організуємо конференції та форуми будь-якого масштабу. Довіряйте організацію Вашої події професіоналам!"
            ]
        },
        {
            "id": 1,
            "name": "Урочисті відкриття",
            "mainImage": "/images/categories/2_1.webp",
            "images": [
                "/images/categories/2_1.webp",
                "/images/categories/2_2.webp",
                "/images/categories/2_3.webp",
                "/images/categories/2_4.webp",
                "/images/categories/2_5.webp",
                "/images/categories/2_6.webp"
            ],
            "text": [
                "Урочисте відкриття є одним з найефективніших та найяскравіших інструментів івент-маркетингу, який відіграє важливу роль у подальшому розвитку компанії та бізнесу на ринку.",
                "Успішне проведення заходу такого формату позитивно впливає на підвищення впізнаваності Вашого бренду, просування продуктів та формування іміджу компанії. Запорукою результативного проведення урочистого відкриття є професійний івент-менеджмент, який команда Global Events забезпечить на найвищому рівні.",
                "Наша івент-агенція розробить найкращу стратегію та формат івенту саме для Вашого бізнесу, враховуючи усі його особливості та бажані результати. Від концепції та менеджменту до маркетингу та реалізації заходу – з івент-агенцією Global Events урочисте відкриття перетвориться на справжнє свято для Вашої компанії та запрошених гостей."
            ]
        },
        {
            "id": 2,
            "name": "Корпоративи",
            "mainImage": "/images/categories/3_1.webp",
            "images": [
                "/images/categories/3_1.webp",
                "/images/categories/3_2.webp",
                "/images/categories/3_3.webp",
                "/images/categories/3_4.webp",
                "/images/categories/3_5.webp",
                "/images/categories/3_6.webp"
            ],
            "text": [
                "Такі івенти важливо продумати таким чином, аби вони змогли донести основні цінності компанії до кожного її працівника. Водночас корпоративи та тімбілдинги потребують не лише ефективної організації, а й цікавих ідей, які зроблять їх яскравими та незабутніми.",
                "Івент-агенція Global Events запропонує та реалізує креативні ідеї корпоративів та організує у Львові корпоратив будь-якого масштабу та складності, втіливши усі цілі Вашої компанії завдяки ретельно продуманій концепції.",
                "Окрім цього, команда Global Events також пропонує професійну організацію літніх та новорічних корпоративів у сучасному форматі онлайн. На відміну від офлайн заходів онлайн-корпоративи мають свої особливості, до яких належить вчасна термінова доставка food- та party-боксів для необмеженої кількості співробітників компанії, технічне забезпечення онлайн-трансляції для усіх учасників заходу та розробка креативної шоу-програми, активностей та квестів, до яких зможе долучитися кожен із гостей."
            ]
        },
        {
            "id": 3,
            "name": "Презентації продукту",
            "mainImage": "/images/categories/4_1.webp",
            "images": [
                "/images/categories/4_1.webp",
                "/images/categories/4_2.webp",
                "/images/categories/4_3.webp",
                "/images/categories/4_4.webp",
                "/images/categories/4_5.webp",
                "/images/categories/4_6.webp"
            ],
            "text": [
                "Презентація нового продукту – це невід’ємна складова успішного івент-маркетингу Вашої компанії та бізнесу. Адже захід такого формату слугує додатковим інструментом не лише для привернення уваги Ваших потенційних клієнтів, а й завоювання їх довіри.",
                "Саме тому для ефективної організації презентації продукту важливо подбати про правильний івент-менеджмент, звернувшись до професійної івент-агенції у Львові – Global Events.",
                "Презентація Вашого продукту від Global Events дозволяє виконати основні маркетингові задачі цього заходу – охоплення широкої цільової аудиторії, підвищення впізнаваності продукту та створення позитивного іміджу Вашого бренду."
            ]
        },
        {
            "id": 4,
            "name": "Декор і продакшн",
            "mainImage": "/images/categories/5_1.webp",
            "images": [
                "/images/categories/5_1.webp",
                "/images/categories/5_2.webp",
                "/images/categories/5_3.webp",
                "/images/categories/5_4.webp",
                "/images/categories/5_5.webp",
                "/images/categories/5_6.webp"
            ],
            "text": [
                "Декор і продакшн – це основа вражаючої атмосфери будь-якого заходу. Саме ці елементи формують перше враження гостей, створюють настрій та підкреслюють унікальність Вашого бренду.",
                "Кожна деталь – від сценічного оформлення й технічного забезпечення до дизайнерських рішень у декорі – працює на те, щоб Ваш івент став справжнім витвором мистецтва. Продумане поєднання естетики та технологій дозволяє перетворити будь-який простір на індивідуальну історію, яка захоплює та надихає.",
                "Команда Global Events забезпечує повний цикл продакшну: розробку концепції, виготовлення конструкцій, світлове та звукове рішення, флористику, оформлення залу й технічний супровід. Ми врахуємо всі особливості Вашого бренду та створимо дизайн, який максимально підкреслить його характер і цінності."
            ]
        }
    ]
}
